Repository: Arwa-14/Dosee
Catalog: *.lproj/Localizable.strings
Languages: ar

source: dose
ar: جرعة

source: Doses
ar: جرعاتي

source: My doses
ar: جرعاتي

source: Today
ar: اليوم

source: time of dose
ar: وقت الابرة

source: Insulin type
ar: نوع الانسولين

source: SAVE
ar: حفظ

source: Allow notification
ar: السماح بالاشعارات

source: No alarm added
ar: لا يوجد تنبيهات

source: ALARM INFORMATION
ar: بيانات المنبه

source: ALARM REPEAT
ar: تكرار المنبه

source: ALARM ACTIVITY
ar: مدة المنبه

source: Music
ar: صوت المنبه

source: Reminder is easier with us ..
ar: اسهل معنا

source: Diabete care at your fingertips
ar: اهتم بسكرك بخطوة بسيطة

source: Get Started
ar: ابدأ
